---
kind: other
id: Properties.T:Autodesk.Revit.DB.GenericForm
source: html/3b39f927-1817-7561-03d1-2f3b0ca93208.htm
---
# GenericForm Properties

The id of the assembly instance to which the element belongs.